##  创建元组
>>> t = ()    # 定义空元组
>>> t
()
>>> t = (1,)   # 定义长度为1的元组，必须加上逗号
>>> t
(1,)
>>> t = (1)   # 定义长度为1的元组，必须加上逗号，如果不加，系统会识别错误
>>> t
1
>>> type(t)   # 定义长度为1的元组，系统识别为整数类型
<class 'int'>
>>> t = (0,'Pi',1.3,6)   # 定义长度为4的元组
>>> t
(0, 'Pi', 1.3, 6)
>>> t = 0,'Pi',1.3,6   # 定义长度为4的元组（省略括号方式）
>>> t
(0, 'Pi', 1.3, 6)
>>> t = 1,2   # 定义长度为2的元组（省略括号方式）
>>> t
(1, 2)
>>> t = (1,2,(4,5))   # 定义二维的元组
>>> t
(1, 2, (4, 5))
>>> t = tuple('hello')   # 用tuple函数定义的元组
>>> t
('h', 'e', 'l', 'l', 'o')

## 删除元组
>>> del(t)    #删除元组t

## 元素访问
>>> t = tuple('hello')    # 创建元组
>>> t[3]    # 访问下标为3的元素
'l'
>>> t[2]    # 访问下标为2的元素
'l'
>>> t[1:3]    # 访问下标为1，2的元素
('e', 'l')
>>> len(t)    # 元组长度
5
>>> t2 = tuple('dev')    # 创建t2元组
>>> t + t2    # 元组相加
('h', 'e', 'l', 'l', 'o', 'd', 'e', 'v')
>>> t * 3    # 元组重复
('h', 'e', 'l', 'l', 'o', 'h', 'e', 'l', 'l', 'o', 'h', 'e', 'l', 'l', 'o')
>>> for x in t:    #循环访问元组元素
	print(x)

h
e
l
l
o
>>> 'i' in t    # 判断i是否为t的元素
False
>>> 'e' in t    # 判断e是否为t的元素
True
>>> t.index('l')    # 查找元素l并返回下标
2
>>> t.count('l')    # 查找元素l并返回下标
2
